#-*- coding=utf-8 -*-

import random


def rand_name(gender=''):
  len_opt = [1, 2]
  first_name_opt_male = ['绍', '功', '松', '厚', '庆', '磊', '民', '友', '裕', '河', '哲', '之', '轮', '翰', '朗', '伯', '宏', '言', '若', '鸣', '朋', '斌', '利', '清', '飞', '彬', '富', '顺', '信', '子', '杰', '涛', '昌', '林', '有', '坚', '和', '彪', '博', '诚', '先', '敬', '震', '振', '晨', '辰', '士', '建', '家', '致', '炎', '德', '行', '时', '泰', '志', '武', '中', '榕', '奇', '鹏', '楠', '泽', '风', '博', '诚', '伟', '刚', '勇', '毅', '俊', '峰', '强', '军', '平', '东', '文', '兴', '良', '海', '山', '仁', '波', '宁', '贵', '福', '生', '龙', '江', '超', '浩', '亮', '政', '谦', '亨', '固', '成', '康', '星', '壮', '会', '思', '豪', '心', '邦', '承', '乐', '盛', '雄', '琛', '先', '敬', '震', '振', '壮', '茂', '磊', '航', '辉', '力', '明', '元', '全', '国', '胜', '学', '祥', '才', '发', '光', '天', '达', '钧', '冠', '策', '腾', '弘', '永', '健', '世', '广', '义', '安', '卓', '显', '趋', '奋', '憧', '德', '道', '正', '伦', '祖', '继', '嗣', '绍', '家', '业', '昌', '稷', '信', '仁', '诚', '贤', '和', '善', '友', '义', '清', '气', '澄', '敬', '庭', '博', '慕', '志', '尚', '泽', '博', '浩', '嘉', '家', '杰', '宇', '涵', '铭', '哲', '皓', '林', '文', '子', '俊', '浩', '明', '思']
  first_name_opt_female = ['芬', '芳', '芯', '花', '茜', '荭', '荷', '莲', '莉', '莹', '菊', '芝', '萍', '燕', '苹', '荣', '草', '蕊', '芮', '蓝', '莎', '菀', '姑', '姜', '姣', '嫂', '嫦', '嫱', '姬', '娇', '娟', '嫣', '婕', '婧', '娴', '婉', '姐', '姞', '姯', '姲', '姳', '娘', '娜', '妹', '妍', '妙', '妹', '娆', '娉', '娥', '媚', '媱', '嫔', '婷', '玟', '环', '珆', '珊', '珠', '玲', '珴', '瑛', '琼', '瑶', '瑾', '瑞', '珍', '琦', '玫', '琪', '琳', '环', '琬', '瑗', '琰', '薇', '珂', '俞', '倩', '倪', '倰', '偀', '偲', '妆', '佳', '亿', '仪', '寒', '宜', '女', '奴', '妶', '好', '妃', '姗', '姝', '姹', '姿', '婵', '菁', '苑', '芸', '芊', '茗', '荔', '菲', '蓉', '英', '蓓', '蕾', '薰', '颖', '芃', '蔓', '莓', '曼', '水', '淼', '滟', '滢', '淑', '洁', '清', '澜', '波', '淞', '渺', '漩', '漪', '涟', '湾', '汇', '冰', '冷', '冽', '霜', '雪', '霞', '霖', '香', '馡', '馥', '秋', '秀', '露', '飘', '育', '滢', '馥', '筠', '柔', '竹', '霭', '凝', '晓', '欢', '枫', '巧', '美', '静', '惠', '翠', '雅', '红', '春', '艳', '凡', '凤', '风', '贞', '勤', '叶', '雁', '钰', '嘉', '锦', '黛', '怡', '情', '林', '梦', '越', '悦', '希', '宁', '欣', '容', '岚', '嵘', '兰', '羽', '素', '云', '华', '丽', '俪', '叆', '呤', '咛', '囡', '彩', '彤', '彨', '怜', '晴', '月', '明', '晶', '昭', '星', '卿', '毓', '可', '璧', '青', '灵', '彩', '慧', '盈', '眉', '丹', '彤', '颜', '影', '韵', '音', '银', '纯', '纹', '思', '丝', '纤', '爽', '舒', '伊', '依', '亚', '融', '园', '文', '心', '火', '炎', '烁', '炫', '煜', '烟', '炅', '然', '冉', '平', '屏', '评', '宛', '玉', '雨', '佳', '菲', '思', '梦', '婷', '雅', '宁', '若', '萱', '嘉', '如', '妍', '如', '嫣', '妩', '妙', '筠', '柔', '竹', '霭', '凝', '晓', '欢', '霄', '枫', '芸', '菲', '寒', '伊', '亚', '宜', '可', '姬', '舒', '影', '荔', '枝', '思', '丽', '秀', '娟', '英', '华', '慧', '巧', '美', '娜', '静', '淑', '惠', '珠', '翠', '雅', '芝', '玉', '萍', '红', '娥', '玲', '芬', '芳', '燕', '彩', '春', '菊', '勤', '珍', '贞', '莉', '兰', '凤', '洁', '梅', '琳', '素', '云', '莲', '真', '环', '雪', '荣', '爱', '妹', '霞', '香', '月', '莺', '媛', '艳', '瑞', '凡', '佳', '嘉', '琼', '桂', '娣', '叶', '璧', '璐', '娅', '琦', '晶', '妍', '茜', '秋', '珊', '莎', '锦', '黛', '青', '倩', '婷', '姣', '婉', '娴', '瑾', '颖', '露', '瑶', '怡', '婵', '雁', '蓓', '纨', '仪', '荷', '丹', '蓉', '眉', '君', '琴', '蕊', '薇', '菁', '梦', '岚', '苑', '婕', '馨', '瑗', '琰', '韵', '融', '园', '艺', '咏', '卿', '聪', '澜', '纯', '毓', '悦', '昭', '冰', '爽', '琬', '茗', '羽', '希', '宁', '欣', '飘', '育', '滢', '馥']
  last_name_opt_300 = ['李', '王', '张', '刘', '陈', '杨', '赵', '黄', '周', '吴', '徐', '孙', '胡', '朱', '高', '林', '何', '郭', '马', '罗', '梁', '宋', '郑', '谢', '韩', '唐', '冯', '于', '董', '萧', '程', '曹', '袁', '邓', '许', '傅', '沈', '曾', '彭', '吕', '苏', '卢', '蒋', '蔡', '贾', '丁', '魏', '薛', '叶', '阎', '余', '潘', '杜', '戴', '夏', '钟', '汪', '田', '任', '姜', '范', '方', '石', '姚', '谭', '廖', '邹', '熊', '金', '陆', '郝', '孔', '白', '崔', '康', '毛', '邱', '秦', '江', '史', '顾', '侯', '邵', '孟', '龙', '万', '段', '漕', '钱', '汤', '尹', '黎', '易', '常', '武', '乔', '贺', '赖', '龚', '文', '庞', '樊', '兰', '殷', '施', '陶', '洪', '翟', '安', '颜', '倪', '严', '牛', '温', '芦', '季', '俞', '章', '鲁', '葛', '伍', '韦', '申', '尤', '毕', '聂', '丛', '焦', '向', '柳', '邢', '路', '岳', '齐', '沿', '梅', '莫', '庄', '辛', '管', '祝', '左', '涂', '谷', '祁', '时', '舒', '耿', '牟', '卜', '路', '詹', '关', '苗', '凌', '费', '纪', '靳', '盛', '童', '欧', '甄', '项', '曲', '成', '游', '阳', '裴', '席', '卫', '查', '屈', '鲍', '位', '覃', '霍', '翁', '隋', '植', '甘', '景', '薄', '单', '包', '司', '柏', '宁', '柯', '阮', '桂', '闵', '欧阳','解', '强', '柴', '华', '车', '冉', '房', '边', '辜', '吉', '饶', '刁', '瞿', '戚', '丘', '古', '米', '池', '滕', '晋', '苑', '邬', '臧', '畅', '宫', '来', '嵺', '苟', '全', '褚', '廉', '简', '娄', '盖', '符', '奚', '木', '穆', '党', '燕', '郎', '邸', '冀', '谈', '姬', '屠', '连', '郜', '晏', '栾', '郁', '商', '蒙', '计', '喻', '揭', '窦', '迟', '宇', '敖', '糜', '鄢', '冷', '卓', '花', '仇', '艾', '蓝', '都', '巩', '稽', '井', '练', '仲', '乐', '虞', '卞', '封', '竺', '冼', '原', '官', '衣', '楚', '佟', '栗', '匡', '宗', '应', '台', '巫', '鞠', '僧', '桑', '荆', '谌', '银', '扬', '明', '沙', '薄', '伏', '岑', '习', '胥', '保', '和', '蔺']

  first_name_len = random.choice(len_opt)

  last_name = random.choice(last_name_opt_300)
  first_name = ''

  if gender == 'M':
    first_name_opt = first_name_opt_male
  elif gender == 'F':
    first_name_opt = first_name_opt_female
  else:
    first_name_opt = first_name_opt_male + first_name_opt_female
  #first name opt

  while first_name_len:
    first_name += random.choice(first_name_opt)
    first_name_len -= 1
  #while first name

  res = last_name + first_name

  print('generate a %s name: %s' % (gender, res))
  return res
#rand name

if __name__ == '__main__':
  rand_name('M')
  rand_name('F')
  rand_name()